Repository: tildearrow/kwin-lowlatency
Catalog: po/*/kcmkwm.po
Languages: pa

# NAME OF TRANSLATORS
source: Your names
pa: ਅਮਨਪਰੀਤ ਸਿੰਘ ਆਲਮ

# EMAIL OF TRANSLATORS
source: Your emails
pa: aalam@users.sf.net

source: M&ouse wheel:
pa: ਮਾਊਸ ਪਹੀਆ(&o):

source: Move
pa: ਭੇਜੋ

source: Activate, Raise & Move
pa: ਸਰਗਰਮ, ਉਭਰਿਆ ਤੇ ਏਧਰ-ਓਧਰ

source: Toggle Raise & Lower
pa: ਉਭਾਰਿਆ ਹੇਠਾਂ ਤਬਦੀਲ ਕਰੋ

source: Resize
pa: ਮੁੜ-ਆਕਾਰ

source: Raise
pa: ਉਭਾਰੋ

source: Lower
pa: ਹੇਠਾਂ

source: Minimize
pa: ਨਿਊਨਤਮ

source: Decrease Opacity
pa: ਧੁੰਧਲਤਾ ਘਟਾਓ

source: Increase Opacity
pa: ਧੁੰਧਲਤਾ ਵਧਾਓ

source: Nothing
pa: ਕੁਝ ਨਹੀਂ

source: Ri&ght button:
pa: ਸੱਜਾ ਬਟਨ(&g):

source: &Wheel
pa: ਪਹੀਆ(&W)

source: Middle b&utton:
pa: ਮੱਧ ਬਟਨ(&u):

source: &Left button:
pa: ਖੱਬਾ ਬਟਨ(&L):

source: Inner Window, Titlebar & Frame
pa: ਅੰਦਰੂਨੀ ਵਿੰਡੋ, ਟਾਇਟਲਬਾਰ ਅਤੇ ਫਰੇਮ

source: Activate, Raise & Pass Click
pa: ਸਰਗਰਮ, ਉਭਾਰਿਆ ਤੇ ਕਲਿਕ ਭੇਜੋ

source: Activate & Pass Click
pa: ਸਰਗਰਮ ਤੇ ਕਲਿਕ ਭੇਜੋ

source: Activate
pa: ਸਰਗਰਮ

source: Activate & Raise
pa: ਸਰਗਰਮ ਤੇ ਉਭਾਰੋ

source: &Right button:
pa: ਸੱਜਾ ਬਟਨ(&R):

source: Scroll
pa: ਸਕਰੋਲ

source: Activate & Scroll
pa: ਸਰਗਰਮ ਤੇ ਸਕਰੋਲ

source: Activate, Raise & Scroll
pa: ਸਰਗਰਮ, ਉਭਰਿਆ ਤੇ ਏਧਰ-ਓਧਰ

source: Raise/Lower
pa: ਉਭਾਰੋ/ਹੇਠਾਂ

source: Shade/Unshade
pa: ਸ਼ੇਡ/ਅਣ-ਸ਼ੇਡ

source: Maximize/Restore
pa: ਅਧਿਕਤਮ/ਮੁੜ-ਪ੍ਰਾਪਤ

source: Keep Above/Below
pa: ਉੱਪਰ ਰੱਖੋ/ਹੇਠਾਂ

source: Move to Previous/Next Desktop
pa: ਅਗਲੇ/ਪਿਛਲੇ ਵੇਹੜੇ 'ਚ ਜਾਓ

source: Change Opacity
pa: ਧੁੰਧਲਤਾ ਤਬਦੀਲ

source: Switch to Window Tab to the Left/Right
pa: ਵਿੰਡੋ ਟੈਬ ਖੱਬੇ/ਸੱਜੇ ਬਦਲੋ

source: M&iddle button:
pa: ਮੱਧ ਬਟਨ(&i):

source: Inactive Inner Window
pa: ਅੰਦਰੂਨੀ ਵਿੰਡੋ ਨਾ-ਸਰਗਰਮ

source: Left &button
pa: ਖੱਬਾ ਬਟਨ(&b)

source: Modifier &key:
pa: ਸੋਧ ਕੀ(&k):

source: Meta
pa: ਮੈਟਾ

source: Window Tabbing
pa: ਵਿੰਡੋ ਟੈਬਿੰਗ

source: Hide inactive window tabs from the taskbar
pa: ਟਾਸਕਬਾਰ ਵਿੱਚੋਂ ਨਾ-ਸਰਗਰਮ ਵਿੰਡੋ ਟੈਬ ਓਹਲੇ

source: Automatically group similar windows
pa: ਰਲਦੀਆਂ ਵਿੰਡੋ ਲਈ ਆਟੋਮੈਟਿਕ ਗਰੁੱਪ

source: Switch to automatically grouped windows immediately
pa: ਗਰੁੱਪ ਕੀਤੀਆਂ ਵਿੰਡੋਜ਼ ਉੱਤੇ ਤੁਰੰਤ ਜਾਓ

source: &Placement:
pa: ਸਥਿਤ(&P):

source: Smart
pa: ਕੁਸ਼ਲ

source: Maximizing
pa: ਅਧਿਕਤਮ

source: Cascade
pa: ਸਮਾਂਤਰ

source: Random
pa: ਰਲਵਾਂ

source: Centered
pa: ਸੈਂਟਰਡ

source: Zero-Cornered
pa: ਸਿਫਰ-ਕਿਨਾਰਾ

source: Under Mouse
pa: ਮਾਊਸ ਦੇ ਹੇਠਾਂ

source: Shading
pa: ਸ਼ੇਡਿੰਗ

source: Dela&y:
pa: ਅੰਤਰਾਲ(&y):

source: &Enable hover
pa: ਹੋਵਰ ਯੋਗ(&E)

source: Special Windows
pa: ਖਾਸ ਵਿੰਡੋਜ਼

source: Hide utility windows for inactive applications
pa: ਨਾ-ਸਰਗਰਮ ਕਾਰਜਾਂ ਲਈ ਸਹੂਲਤ ਵਿੰਡੋ ਓਹਲੇ

source: &Delay focus by
pa: ਫੋਕਸ ਦੇਰੀ(&D)

source: None
pa: ਕੋਈ ਨਹੀਂ

source: Low
pa: ਘੱਟ

source: Medium
pa: ਮੱਧਮ

source: High
pa: ਜਿਆਦਾ

source: Extreme
pa: ਬਹੁਤ ਅਧਿਕ

source: Policy
pa: ਪਾਲਸੀ

source: C&lick raises active window
pa: ਸਰਗਰਮ ਵਿੰਡੋ ਕਲਿੱਕ ਨਾਲ ਉਭਾਰੋ(&l)

source: S&eparate screen focus
pa: ਵੱਖਰਾ ਸਕਰੀਨ ਫੋਕਸ(&e)

source: Active screen follows &mouse
pa: ਐਕਟਿਵ ਸਕਰੀਨ ਮਾਊਂਸ ਮੁਤਾਬਕ ਚੱਲੇ

source: &Focus
pa: ਫੋਕਸ(&F)

source: &Titlebar Actions
pa: ਟਾਇਟਲਬਾਰ ਐਕਸ਼ਨ(&T)

source: Window Actio&ns
pa: ਵਿੰਡੋ ਐਕਸ਼ਨ(&n)

source: &Moving
pa: ਭੇਜਿਆ ਜਾ ਰਿਹਾ ਹੈ(&M)

source: Ad&vanced
pa: ਤਕਨੀਕੀ(&v)

source: Window Behavior Configuration Module
pa: ਵਿੰਡੋ ਰਵੱਈਆ ਸੰਰਚਨਾ ਮੋਡੀਊਲ

source: (c) 1997 - 2002 KWin and KControl Authors
pa: (c) ੧੯੯੭-੨੦੦੨ ਕੇਵਿਨ ਤੇ ਕੇਕੰਟਰੋਲ ਲੇਖਕ

source: Matthias Ettrich
pa: ਮੈਥੂਸ ਇੱਟਰਿਚ

source: Waldo Bastian
pa: ਵਾਲਡੂ ਬਾਸਟਿਨ

source: Cristian Tibirna
pa: ਕਰਿਸਟਿਨ ਤੀਬੀਰਨਾ

source: Maximize
pa: ਵੱਧੋ-ਵੱਧ

source: Maximize (vertical only)
pa: ਅਧਿਕਤਮ (ਲੰਬਕਾਰੀ ਹੀ)

source: Maximize (horizontal only)
pa: ਅਧਿਕਤਮ (ਖਿਤਿਜੀ ਹੀ)

source: &Double-click:
pa: ਡਬਲ ਕਲਿੱਕ(&D):

source: Behavior on <em>double</em> click into the titlebar.
pa: ਟਾਇਟਲਬਾਰ ਵਿੱਚ <em>ਦੋ</em> ਵਾਰ ਦਬਾਉਣ ਤੇ ਰਵੱਈਆ

source: Shade
pa: ਸ਼ੇਡ

source: Close
pa: ਬੰਦ ਕਰੋ

source: On All Desktops
pa: ਸਭ ਡੈਸਕਟਾਪਾਂ ਉੱਤੇ

source: Wheel event:
pa: ਪਹੀਆ ਘਟਨਾ:

source: Handle mouse wheel events
pa: ਮਾਊਸ ਪਹੀਆ ਘਟਨਾਵਾਂ ਹੈਂਡਲ ਕਰੋ

source: Active
pa: ਸਰਗਰਮ

source: Inactive
pa: ਨਾ-ਸਰਗਰਮ

source: Left button:
pa: ਖੱਬਾ ਬਟਨ:

source: Operations Menu
pa: ਕਾਰਵਾਈ ਮੇਨੂ

source: Start Window Tab Drag
pa: ਵਿੰਡੋ ਟੈਬ ਡਰੈਗ ਸ਼ੁਰੂ

source: Activate & Lower
pa: ਸਰਗਰਮ ਤੇ ਹੇਠਾਂ

source: Middle button:
pa: ਮੱਧ ਬਟਨ:

source: Right button:
pa: ਸੱਜਾ ਬਟਨ:

source: Behavior on <em>left</em> click onto the maximize button.
pa: ਅਧਿਕਤਮ ਬਟਨ ਤੇ <em>ਖੱਬਾ</em> ਬਟਨ ਦਬਾਉਣ ਤੇ ਰਵੱਈਆ ਹੈ।

source: Behavior on <em>middle</em> click onto the maximize button.
pa: ਟਾਇਟਲਬਾਰ ਵਿੱਚ <em>ਦੋ</em> ਵਾਰ ਦਬਾਉਣ ਤੇ ਰਵੱਈਆ ਹੈ।

source: Behavior on <em>right</em> click onto the maximize button.
pa: ਅਧਿਕਤਮ ਬਟਨ ਤੇ <em>ਸੱਜਾ</em> ਬਟਨ ਦਬਾਉਣ ਤੇ ਰਵੱਈਆ ਹੈ।

source: Titlebar
pa: ਟਾਇਟਲਬਾਰ

source: Maximize Button
pa: ਅਧਿਕਤਮ ਬਟਨ

source: pixel
pa: ਪਿਕਸਲ

source: &Center snap zone:
pa: ਸੈਂਟਰ ਸਨੈਪ ਜ਼ੋਨ(&C):

source: Display window &geometry when moving or resizing
pa: ਵਿੰਡੋ ਏਧਰ-ਓਧਰ ਜਾਂ ਮੁੜ ਆਕਾਰ ਕਰਦਿਆਂ ਵਿੰਡੋ ਢਾਂਚਾ ਵੇਖਾਓ(&g)

source: &Window snap zone:
pa: ਵਿੰਡੋ ਸਨੈਪ ਜ਼ੋਨ(&W):

source: Windows
pa: ਵਿੰਡੋਜ਼

source: Snap Zones
pa: ਸਨੈਪ ਖੇਤਰ
