Repository: tildearrow/kwin-lowlatency
Catalog: po/*/kwin_scripting.po
Languages: ar, cs, el, et, fi, ia, nn, ro, ru

# NAME OF TRANSLATORS
source: Your names
ar: صفا الفليج
cs: Vít Pelčák
el: Δημήτρης Καρδαράκος
et: Marek Laane
fi: Lasse Liehu, Tommi Nieminen
ia: Giovanni Sora
nn: Karl Ove Hufthammer
ro: Arthur Țițeică
ru: Александр Лахин

# EMAIL OF TRANSLATORS
source: Your emails
ar: safa1996alfulaij@gmail.com
cs: vit@pelcak.org
el: dimkard@gmail.com
et: qiilaq69@gmail.com
fi: lasse.liehu@gmail.com, translator@legisign.org
ia: g.sora@tiscali.it
nn: karl@huftis.org
ro: arthur.titeica@gmail.com
ru: exclusion@gmail.com

# Error message
source: Plugin does not provide configuration file in expected location
ar: لم توفّر الملحقة ملفّ ضبط في المكان المتوقّع
cs: Modul neposkytuje soubor s nastavením na obvyklém místě
el: Το πρόσθετο δεν παρέχει αρχείο διαμόρφωσης στην αναμενόμενη τοποθεσία
et: Plugin ei paku seadistusfaili eeldatud asukohas
fi: Liitännäisessä ei ole asetustiedostoa odotetussa sijainnissa
ia: Plugin non forni file de configuration in le location expectate
nn: Programtillegget har ikkje oppsettfil på den forventa staden
ro: Extensia nu furnizează fișierul de configurare în locul așteptat
ru: Конфигурация модуля не найдена в ожидаемом расположении

# Assertion failed in KWin script with given value
source: Assertion failed: %1 is not null
ar: فشل التّوكيد: %1 ليس خاليًا
cs: Podmínka nesplněna: %1 je nenulový
el: Αποτυχία δήλωσης: το %1 δεν είναι κενό
et: Eeldus nurjus: %1 ei ole null
fi: Assert ei pitänyt: %1 ei ole null
ia: Assertion falleva: %1 non es nulle
nn: Feil ved føresetnad: %1 er ikkje null
ro: Aserțiunea a eșuat: %1 nu este nul
ru: Невыполнение условия: %1 не null

# Assertion failed in KWin script
source: Assertion failed: argument is null
ar: فشل التّوكيد: المعطى خالٍ
cs: Podmínka nesplněna: Argument je nenulový
el: Αποτυχία δήλωσης: το όρισμα είναι κενό
et: Eeldus nurjus: argument on null
fi: Assert ei pitänyt: parametri on null
ia: Assertion falleva: argumento es nulle
nn: Feil ved føresetnad: argument er null
ro: Aserțiunea a eșuat: argumentul este nul
ru: Невыполнение условия: аргумент равен null

# Error in KWin Script
source: Invalid number of arguments. At least service, path, interface and method need to be provided
ar: عدد معطيات غير صالح. يجب توفير الخدمة، والمسار، والواجهة والطريقة على الأقل
cs: Neplatný počet argumentů. Je potřeba poskytnout alespoň službu, cestu, rozhraní a metodu
el: Μη έγκυρος αριθμός ορισμάτων. Πρέπει να παρέχονται τουλάχιστον η υπηρεσία, η διαδρομή, η διεπαφή και η μέθοδος
et: Vigane argumentide arv. Anda tuleb vähemalt teenus, asukoht, liides ja meetod
fi: Virheellinen parametrien määrä. Ainakin palvelu, polku, rajapinta ja metodi on annettava
ia: Invalide numero de argumentos. On debe provider al minus servicio, percurso, interfacie e methodo.
nn: Ugyldig tal på argument. Du må oppgje minst teneste, mappeadresse, grensesnitt og metode.
ro: Număr nevalid de argumente. Trebuiesc furnizate cel puțin serviciul, calea, interfața și metoda
ru: Недопустимое число аргументов. Должны быть переданы как минимум аргументы service, path, interface и method.

# Error in KWin Script
source: Invalid type. Service, path, interface and method need to be string values
ar: نوع غير صالح. الخدمة، والمسار، والواجهة والطريقة يجب أن يكونوا قيم سلاسل
cs: Neplatný typ. Služba, cesta, rozhraní a metoda musí být řetězce
el: Μη έγκυρος τύπος. Η υπηρεσία, η διαδρομή, η διεπαφή και η μέθοδος πρέπει να έχουν τιμές συμβολοσειράς
et: Vigane tüüp. Teenus, asukoht, liides ja meetod peavad olema stringväärtused
fi: Virheellinen tyyppi. Palvelun, polun, rajapinnan ja metodin tulee olla merkkijonoarvoja
ia: Typo invalide. Servicio, percurso, interfacie e methodo debe esser valores de catena
nn: Ugyldig type. Teneste, mappeadresse, grensesnitt og metode må vera tekstverdiar.
ro: Tip nevalid. Serviciul, calea, interfața și metoda trebuie să fie valori șir
ru: Неверный тип. Аргументы service, path, interface и method должны быть строковыми.

# syntax error in KWin script
source: Invalid number of arguments
ar: عدد معطيات غير صالح
cs: Neplatný počet argumentů
el: Μη έγκυρος αριθμός ορισμάτων
et: Vigane argumentide arv
fi: Virheellinen määrä parametreja
ia: Invalide numero de argumentos
nn: Ugyldig tal på argument
ro: Număr nevalid de argumente
ru: Неверное число аргументов

# KWin Scripting function received incorrect value for an expected type
source: %1 is not a variant type
ar: %1 ليس نوع تنويعة
cs: %1 není typ varianty
el: το %1 δεν είναι ένας τύπος παραλλαγής
et: %1 ei ole tüübiga variant
fi: %1 ei ole variant-tyyppi
ia: %1 non es un typo variante
nn: %1 er ikkje ein variant-type
ro: %1 nu este un tip variabil
ru: %1 не типа variant

# KWin Scripting function received incorrect value for an expected type
source: %1 is not of required type
ar: %1 ليس من الأنواع المطلوبة
cs: %1 není požadovaného typu
el: το %1 δεν είναι του απαιτούμενου τύπου
et: %1 ei ole nõutava tüübiga
fi: %1 ei ole vaadittua tyyppiä
ia: %1 non es del typo requirite
nn: %1 er ikkje av rett type
ro: %1 nu este de tipul cerut
ru: %1 не требуемого типа

# KWin Scripting error thrown due to incorrect argument
source: Second argument to registerScreenEdge needs to be a callback
ar: المعطى الثّاني إلى registerScreenEdge يجب أن يكون ردّ نداء
el: Το δεύτερο όρισμα της registerScreenEdge πρέπει να είναι μια επανάκληση (callback)
et: registerScreenEdge teine argument peab olema tagasiviide
fi: registerScreenEdge-kutsun toisen parametrin on oltava palautekutsu (callback)
ia: Secundo argumento pro registerScreenEdge necessita esser un retro appello
nn: Det andre argumentet til registerScreenEdge må vera eit tilbakekall
ro: Al doilea argument pentru registerScreenEdge trebuie să fie un callback
ru: Вторым аргументом registerScreenEdge должна быть функция обратного вызова

# KWin Scripting error thrown due to incorrect argument
source: Second argument to registerTouchScreenEdge needs to be a callback
el: Το δεύτερο όρισμα της registerTouchScreenEdge πρέπει να είναι μια επανάκληση (callback)
fi: registerScreenEdge-kutsun toisen parametrin on oltava palautekutsu (callback)
nn: Det andre argumentet til registerTouchScreenEdge må vera eit tilbakekall
ru: Вторым аргументом registerTouchScreenEdge должна быть функция обратного вызова

# KWin Scripting error thrown due to incorrect argument
source: Argument for registerUserActionsMenu needs to be a callback
ar: معطى registerUserActionsMenu يجب أن يكون ردّ نداء
el: Το όρισμα για τη registerUserActionsMenu πρέπει να είναι μια επανάκληση (callback)
et: registerUserActionsMenu argument peab olema tagasiviide
fi: registerUserActionsMenu-kutsun toisen parametrin on oltava palautekutsu (callback)
ia: Argumento pro registerUserActionsMenu debe esser un retro appello
nn: Argumentet til registerUserActionsMenu må vera eit tilbakekall
ro: Argumentul pentru registerUserActionsMenu trebuie să fie un callback
ru: Аргументом registerUserActionsMenu должна быть функция обратного вызова

# Assertion failed in KWin script with given value
source: Assertion failed: %1
ar: فشل التّوكيد: %1
cs: Podmínka nesplněna: %1
el: Αποτυχία δήλωσης: %1
et: Eeldus nurjus: %1
fi: Assert ei pitänyt: %1
ia: Assertion falleva: %1
nn: Feil ved føresetnad: %1
ro: Aserțiunea a eșuat: %1
ru: Невыполнение условия: %1

# Assertion failed in KWin script with expected value and actual value
source: Assertion failed: Expected %1, got %2
ar: فشل التّوكيد: توقّعت %1، حصلت على %2
cs: Podmínka nesplněna: Očekáváno %1, získáno %2
el: Αποτυχία δήλωσης: αναμενόταν %1, λήφθηκε %2
et: Eeldus nurjus: oodati %1, saadi %2
fi: Assert ei pitänyt: Odotettiin arvoa %1, mutta arvo oli %2
ia: Assertion falleva: on expectava %1, obteneva %2
nn: Feil ved føresetnad: forventa %1, men fekk %2
ro: Aserțiunea a eșuat: se aștepta %1, s-a obținut %2
ru: Невыполнение условия: Ожидалось %1, а получено %2
